dependent.org
#+title: dependent type
#+html_link_home: index

* introduction

	+ In STΛC, terms depend on terms
	+ In dependent type theory, not only terms, but types can depend on terms.
	+ ~n : ℕ ⊢ isEven(n)~

	Rules are similar as STΛC, but formation (construct types) now also has context

	+ Λ-form now is

		\begin{equation}
		\frac{
			\Gamma \vdash P : Type, \Gamma \vdash Q : Type
		}{
			\Gamma \vdash P \land Q
		}
		\end{equation}

	+ for now, type is proposition, program, sets
	
** corresponding

	 + $\Pi$ is $\forall$
	 + $\Sigma$ is $\exists$
	 + $\Sigma$ but no dependent occurs, is the product, the $A \land B$ or $A \times B$
	 + $\Pi$ but no dependent occurs, is the function type or implies, the $A \to B$

