dependent.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-25 Sat 18:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dependent type</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index"> HOME </a>
</div><div id="content">
<h1 class="title">dependent type</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgacad7a0">1. introduction</a>
<ul>
<li><a href="#org609d8b4">1.1. corresponding</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgacad7a0" class="outline-2">
<h2 id="orgacad7a0"><span class="section-number-2">1</span> introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In STΛC, terms depend on terms</li>
<li>In dependent type theory, not only terms, but types can depend on terms.</li>
<li><code>n : ℕ ⊢ isEven(n)</code></li>
</ul>

<p>
Rules are similar as STΛC, but formation (construct types) now also has context
</p>

<ul class="org-ul">
<li><p>
Λ-form now is
</p>

\begin{equation}
\frac{
	\Gamma \vdash P : Type, \Gamma \vdash Q : Type
}{
	\Gamma \vdash P \land Q
}
\end{equation}</li>

<li>for now, type is proposition, program, sets</li>
</ul>
</div>

<div id="outline-container-org609d8b4" class="outline-3">
<h3 id="org609d8b4"><span class="section-number-3">1.1</span> corresponding</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>\(\Pi\) is \(\forall\)</li>
<li>\(\Sigma\) is \(\exists\)</li>
<li>\(\Sigma\) but no dependent occurs, is the product, the \(A \land B\) or \(A \times B\)</li>
<li>\(\Pi\) but no dependent occurs, is the function type or implies, the \(A \to B\)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-25 Sat 18:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
